#pragma once

#include <cstdint>
#include "../core.hpp"
#include "../quake.hpp"
#include "../db/xpak.hpp"
#include "HLSL.hpp"
namespace game {

namespace scr {
typedef uint32_t ScrString_t;
}

namespace db {
namespace xasset {
struct Material;
struct XModel;
typedef XModel *XModelPtr;
} // namespace xasset
} // namespace db

namespace gfx {

enum class GfxCameraRegion : int8_t {
  CAMERA_REGION_GBUFFER_DEPTH_HACK = 0x0,
  CAMERA_REGION_GBUFFER_DEPTH_HACK_DECAL = 0x1,
  CAMERA_REGION_GBUFFER = 0x2,
  CAMERA_REGION_GBUFFER_DECAL = 0x3,
  CAMERA_REGION_GBUFFER_NO_VOLUME_DECAL = 0x4,
  CAMERA_REGION_LIT_OPAQUE = 0x5,
  CAMERA_REGION_LIT_TRANS = 0x6,
  CAMERA_REGION_LIT_TRANS_POST_RESOLVE = 0x7,
  CAMERA_REGION_LIT_POST_RESOLVE = 0x8,
  CAMERA_REGION_WATER = 0x9,
  CAMERA_REGION_EMISSIVE_FX = 0xA,
  CAMERA_REGION_DEPTH_HACK_SSS = 0xB,
  CAMERA_REGION_FORWARD_SSS = 0xC,
  CAMERA_REGION_DEPTH_HACK = 0xD,
  CAMERA_REGION_DEPTH_HACK_TRANS = 0xE,
  CAMERA_REGION_DEPTH_HACK_POST_BLUR = 0xF,
  CAMERA_REGION_SONAR = 0x10,
  CAMERA_REGION_OIT = 0x11,
  CAMERA_REGION_DEPTH_PRIME = 0x12,
  CAMERA_REGION_UNDERWATER = 0x13,
  CAMERA_REGION_COUNT = 0x14,
  CAMERA_REGION_NONE = 0x14,
};

struct GfxDrawSurfFields {
  uint64_t useSiegeTextures : 1;
  uint64_t objectId : 18;
  uint64_t lateDepthSort : 5;
  uint64_t materialSortedIndex : 16;
  uint64_t techniqueIndexPlusOne : 11;
  uint64_t decalSurfSort : 6;
  uint64_t earlyDepthSort : 7;
};

union GfxSortKey {
  GfxDrawSurfFields fields;
  uint64_t packed;
};

#pragma pack(push, 1)
// sizeof=0x20
struct XPakEntryInfo {
  uint64_t key;
  int64_t offset;
  uint64_t size;
  uint64_t xpakIndex : 5;
  uint64_t compressed : 1;
  uint64_t valid : 1;
  uint64_t adjacentLeftType : 3;
  uint64_t adjacentRightType : 3;
  uint64_t adjacentLeft : 18;
  uint64_t adjacentRight : 18;
  uint64_t padding : 15;
};
ASSERT_SIZE(XPakEntryInfo, 0x20);
#pragma pack(pop)

#pragma pack(push, 1)
struct GfxStreamedPartInfo {
  uint32_t levelCountAndSize;
  uint16_t width;
  uint16_t height;
  XPakEntryInfo xpakEntry;
};
#pragma pack(pop)

#pragma pack(push, 1)
struct _GUID {
  uint32_t Data1;
  uint16_t Data2;
  uint16_t Data3;
  uint8_t Data4[8];
};
#pragma pack(pop)
typedef struct _GUID GUID;
typedef GUID IID;

struct IUnknown;

#pragma pack(push, 8)
struct IUnknownVtbl {
  stdcall_t<int32_t, IUnknown *, const IID *const, void **> QueryInterface;
  stdcall_t<uint32_t, IUnknown *> AddRef;
  stdcall_t<uint32_t, IUnknown *> Release;
};
ASSERT_SIZE(IUnknownVtbl, 0x18);
#pragma pack(pop)

#pragma pack(push, 8)
struct IUnknown {
  IUnknownVtbl *lpVtbl;
};
#pragma pack(pop)

struct ID3D11DeviceChild : IUnknown {};

struct ID3D11View : ID3D11DeviceChild {};

struct ID3D11ShaderResourceView : ID3D11View {};

// Unverified
#pragma pack(push, 1)
struct GfxImageLoadDef {
  char levelCount;
  char numElements;
  char pad[2];
  int32_t flags;
  int32_t format;
  int32_t resourceSize;
  char data[1];
  uint8_t _padding011[3];
};
ASSERT_SIZE(GfxImageLoadDef, 0x14);
#pragma pack(pop)

union GfxTexture {
  ID3D11ShaderResourceView *basemap;
  GfxImageLoadDef *loadDef;
};

enum class GfxImageSemantic : uint8_t {
  UNKNOWN = 0x0,
  TWO_DIMENSIONAL = 0x1,
  DIFFUSE_MAP = 0x2,
  EFFECT_MAP = 0x3,
  NORMAL_MAP = 0x4,
  SPECULAR_MASK = 0x5,
  SPECULAR_MAP = 0x6,
  GLOSS_MAP = 0x7,
  OCCLUSION_MAP = 0x8,
  REVEAL_MAP = 0x9,
  MULTIPLE_MASK = 0xA,
  THICKNESS_MAP = 0xB,
  CAMO_MAP = 0xC,
  ONE_CHANNEL = 0xD,
  TWO_CHANNEL = 0xE,
  EMBLEM = 0xF,
  CUSTOM = 0x10,
  LUT_TPAGE = 0x11,
  LIGHT_COOKIE = 0x12,
  HDR = 0x13,
  EYE_CAUSTIC = 0x14,
  COUNT = 0x15,
};

enum class GfxPixelFormat : uint32_t {
  INVALID = 0x0,
  UNKNOWN = 0x0,
  D24S8 = 0x1,
  D24FS8 = 0x2,
  A8 = 0x3,
  R8_UN = 0x4,
  R8_UI = 0x5,
  D16 = 0x6,
  R16_UN = 0x7,
  R16_UI = 0x8,
  R16F = 0x9,
  R8G8_UN = 0xA,
  R8G8_SNORM = 0xB,
  B5G6R5 = 0xC,
  B4G4R4A4 = 0xD,
  D32F = 0xE,
  R32F = 0xF,
  R16G16_UN = 0x10,
  R16G16_SNORM = 0x11,
  R16G16F = 0x12,
  R9G9B9E5 = 0x13,
  R8G8B8A8 = 0x14,
  R8G8B8A8_SNORM = 0x15,
  B8G8R8A8 = 0x16,
  R8G8B8A8_SRGB = 0x17,
  R10G10B10A2 = 0x18,
  B10G10R10A2 = 0x19,
  R11G11B10F = 0x1A,
  R32G32F = 0x1B,
  R16G16B16A16_UN = 0x1C,
  R16G16B16A16F = 0x1D,
  R32G32B32A32F = 0x1E,
  BC1 = 0x1F,
  BC1_SRGB = 0x20,
  BC2 = 0x21,
  BC2_SRGB = 0x22,
  BC3 = 0x23,
  BC3_SRGB = 0x24,
  BC4 = 0x25,
  BC5 = 0x26,
  BC6_UH = 0x27,
  BC6_SH = 0x28,
  BC7 = 0x29,
  BC7_SRGB = 0x2A,
  R32G32B32A32_UN = 0x2B,
  R32_UI = 0x2C,
  R32G32_UI = 0x2D,
};

typedef uint8_t MapType;
typedef uint8_t GfxImageCategory;
#pragma pack(push, 1)
struct GfxImage {
  GfxStreamedPartInfo streamedParts[4];
  uint8_t streamedPartCount;
  GfxImageSemantic semantic;
  MapType mapType;
  GfxImageCategory category;
  qboolean useFallback;
  GfxTexture texture;
  GfxTexture fallbackTexture;
  uint32_t flags;
  bool delayLoadPixels;
  uint8_t _paddingBD[1];
  uint16_t width;
  uint16_t height;
  uint16_t depth;
  int32_t alignment;
  uint8_t levelCount;
  uint8_t fallbackLevel;
  bool streaming;
  uint8_t _paddingCB[5];
  uint8_t *pixels;
  uint8_t *fallbackPixels;
  uint32_t totalSize;
  uint32_t fallbackSize;
  GfxPixelFormat format;
  uint8_t _paddingEC[4];
  const char *name;
  uint32_t hash;
  uint8_t _paddingFC[4];
  // This might not be here, but the struct has size
  // 0x100 otherwise - correct size is known to be 0x108.
  uint8_t _unknown100[8];
};
ASSERT_SIZE(GfxImage, 0x108);
#pragma pack(pop)

typedef GfxImage *GfxImageHandle;
typedef GfxImage *GfxImagePtr;

typedef uint8_t GfxImageCategory;

union GfxColor {
  uint32_t packed;
  struct {
    uint8_t r;
    uint8_t g;
    uint8_t b;
    uint8_t a;
  } rgba;
  uint8_t array[4];
};

// TODO
struct GfxLightDescription;
struct GfxLightDef;

struct GfxSkinCacheEntry {
  uint32_t frameCount;
  int32_t skinnedCachedOffset;
  uint16_t numSkinnedVerts;
  uint16_t ageCount;
};

struct GpuShaderConstantSet {
  vec4_t scriptVector0;
  vec4_t scriptVector1;
  vec4_t scriptVector2;
  vec4_t scriptVector3;
  vec4_t scriptVector4;
  vec4_t scriptVector5;
  vec4_t scriptVector6;
  vec4_t scriptVector7;
  vec4_t weaponParam0;
  vec4_t weaponParam1;
  vec4_t weaponParam2;
  vec4_t weaponParam3;
  vec4_t weaponParam4;
  vec4_t weaponParam5;
  vec4_t weaponParam6;
  vec4_t weaponParam7;
  vec4_t characterParam0;
  vec4_t characterParam1;
  vec4_t characterParam2;
  vec4_t characterParam3;
  vec4_t characterParam4;
  vec4_t characterParam5;
  vec4_t characterParam6;
  vec4_t characterParam7;
};
ASSERT_SIZE(GpuShaderConstantSet, 0x180);

struct ShaderConstantSet {
  GpuShaderConstantSet values;
  uint32_t used;
};
ASSERT_SIZE(ShaderConstantSet, 0x184);

union GfxSimpleBuffer {
  struct {
    uint64_t m_data : 36;
    uint64_t m_size : 28;
  };
  uint64_t m_packed;
};

typedef GfxSimpleBuffer GfxIndexBuffer;
typedef GfxSimpleBuffer GfxVertexBuffer;

class ID3D11Resource : ID3D11DeviceChild {};

class ID3D11Buffer : ID3D11Resource {};

struct GfxBuffer {
  ID3D11Buffer ro;
  ID3D11Buffer rw;
};

#pragma pack(push, 1)
struct BlendTargetRemap {
  scr::ScrString_t name;
  uint16_t index;
  uint8_t _padding06[2];
};
#pragma pack(pop)

struct GfxExtraCamActiveState {
  bool anyActive;
  bool active[4];
  const GfxImage *renderTarget[4];
};

enum class eRenderMethod : uint32_t {
  OFF = 0x0,
  DEFAULT_MATERIAL = 0x1,
  THERMAL_MATERIAL = 0x2,
  CUSTOM_MATERIAL = 0x3,
  FORCE_CUSTOM_MATERIAL = 0x4,
  COUNT = 0x5,
};

enum class eRenderCulling : uint32_t {
  CULL = 0x0,
  NO_CULL = 0x1,
  COUNT = 0x2,
};

enum class PostfxAnimation : uint32_t {
  hold = 0x0,
  linear = 0x1,
  step = 0x2,
  ease_in = 0x3,
